import javax.swing.JFrame;// 1 клас, який знає як "малювати" і працювати з вікном
import javax.swing.JLabel;// 4 клас елемента для тексту і зображень
import java.awt.FlowLayout;// 11 клас для розміщення елементів "ланцюжком"
//1 public class Vikno {
	public class Vikno extends JFrame{ //тепер клас Vikno - наслідує всі поля і властивости класу JFrame
		
		JLabel lbl1;// 5 создадим поле класу JLabel
		JLabel lbl2;// 8 
		
		public Vikno(){ // 2 конструктор для класу Vikno
			super("Моє перше вікно JFrame");
			setLayout(new FlowLayout());// 12 setLayout - це метод класу JFrame - 
			// ми кажемо як розміщувати елементи у вікні,
			// в дужках в якості аргументу ми передали new FlowLayout(),
			// цім ми кажемо нашему вікну: коли ми будемо додавати нові елементи 
			// в вікно не скідивати іх на купу, а запитати класу new FlowLayout()
			// и цей клас скаже вікнові як розмістити елементи у вікні
			// 3 ключеве слово в java - super- означає: викликати підходящій
			// конструктор батьківського класу
			// В класі JFrame - є конструетор якій має лише один параметр
			// і цей параметр встанолюває взаговолок нашего вікна.
			// В класі JFrame - є конструктор, якій приймає параметри
			// типу String
			lbl1 = new JLabel("Привіт, це перший JLabel, ");// 6 виведення тексту у 
			// вікни. Ініцілізували новий об'єкт lbl1 = new JLabel("Привіт, це перший JLabel");
			// класу JLabel
			add(lbl1);// 7 додали цей об'єкт add(lbl1); в наше вікно
			lbl2 = new JLabel("2й JLabel");// 9
			add(lbl2);// 10
		}
}
