
public class Calendar {

	public static void main(String[] args) {
		
		Podiya p = new Podiya(24, 8, 1991, "День Незалежності України");//
		//за допомогую конструктора записуемо значення и передаемо
		//і конструктор записує ці значеня в поля класу Podiya
		System.out.printf("%s%n", p); // java автоматично(приховано) викликає метод toString() з java.lang.Object
		//System.out.printf("%s%n", p.toString()); //викликала открито
		
		
//якщо ми хочемо вивести значення об'єкта у вигляді String (текстовим рядком)
//Java знає, що потрібно знайти в цьому класі і викликати метод toString()
//якщо вона не знаходить метод toString() в класі цього об'єкта
//вона викликає метод toString() з суперкласу java.lang.Object
//який повертає наступне: [им'я класу + "@" + хеш об'єкта]
		
	}

}
